clear all; close all; clc;

A1 = [1 2 3;
      4 5 6;
      7 8 9];
A2 = [1 2 3;
      4 5 6;
      7 8 12];
A3 = [1 1 2 3;
      1 1 4 9;
      1 7 8 9;
      1 7.1 8.2 9.3];
B1 = [1; 1; 1];
B2 = [1; 1; 2];
B3 = [1; 1; 1; 1];

%(1)
%矩阵A1的LU分解、奇异值分解、特征值、特征向量
%矩阵A1的LU分解
[L1,U1]=lu(A1)
%矩阵A1的奇异值分解
S1=svd(A1)
%矩阵A1的特征值、特征向量,其中V1为特征值，D1为特征向量
[V1,D1]=eig(A1)

%矩阵A2的LU分解、奇异值分解、特征值、特征向量、行列式、逆
%矩阵A2的LU分解
[L2,U2]=lu(A2)
%矩阵A2的奇异值分解
S2=svd(A2)
%矩阵A2的特征值、特征向量,其中V2为特征值，D2为特征向量
[V2,D2]=eig(A2)
%矩阵A2的行列式d2
d2=det(A2)
%矩阵A2的逆a2
a2=inv(A2)

%矩阵A3的行列式、逆
%矩阵A3的行列式d3
d3=det(A3)
%矩阵A3的逆a3
a3=inv(A3)

%(2)
%求解A1*x=B1, A2*x=B2, A3*x=B3；解分别为x1, x2, x3
x1=A1\B1
x2=A2\B2
x3=A3\B3








