clear; clc;
%%初始化参数
A=[0,    1,0,0;
  20.601,0,0,0;
   0,    0,0,1;
 -0.4905,0,0,0];                                                %A矩阵
B=[0;-1;0;0.5];                                                 %B矩阵
C=[0,0,1,0];                                                    %C矩阵
p=[-2.5+2.5*1j,-2.5-2.5*1j,-10,-10,-10];                          %极点配置
v=1;                                                            %阶跃信号的幅值
t=0:0.1:20;                                                     %时间向量
%%判断可控性并计算结果
if(rank(ctrb(A,B))==length(A))                                  %判断是否完全可控
    disp('该系统完全可控');
    [K,kI,x,y,t,x_ss,y_ss,u_ss,zeta_ss]=pp_sifu0(A,B,C,p,v,t);  %根据所给的条件参数来计算相应的参数
    fprintf('积分增益常数kI:%f\n',kI)
    fprintf('状态反馈增益矩阵K:[%f,%f,%f,%f]\n',K(1),K(2),K(3),K(4))
else 
    disp('该系统不完全可控');                                    %显示系统不完全可控
end
x3=[0,0,1,0,0]*x';                                               %取位置x的数据
plot(t,x3);                                                     %画出响应的结果
title('位置为x时的响应曲线');                        
grid on